RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_utils_impl.c
/***************************************************************************//**
* \file cyhal_utils_impl.c
*
* \brief
* Provides utility functions for working with the CAT1/CAT2 HAL implementation.
*
********************************************************************************
* \copyright
* Copyright 2018-2022 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <stdlib.h>
#include <stdarg.h>
#include "cyhal_utils.h"
#include "cyhal_utils_impl.h"
#include "cyhal_hwmgr.h"
#include "cyhal_interconnect.h"
#include "cyhal_clock.h"

#if defined(__cplusplus)
extern "C"
{
#endif

#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
#define _CYHAL_MXSPERI_PCLK_DIV_CNT(gr) \
    case CYHAL_CLOCK_BLOCK_PERIPHERAL##gr##_8BIT: return PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_8_VECT; \
    case CYHAL_CLOCK_BLOCK_PERIPHERAL##gr##_16BIT: return PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_VECT; \
    case CYHAL_CLOCK_BLOCK_PERIPHERAL##gr##_16_5BIT: return PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_5_VECT; \
    case CYHAL_CLOCK_BLOCK_PERIPHERAL##gr##_24_5BIT: return PERI_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_24_5_VECT;
#elif defined(COMPONENT_CAT1D)
#define _CYHAL_MXSPERI_PCLK_DIV_CNT(instance, gr) \
    case CYHAL_CLOCK_BLOCK##instance##_PERIPHERAL##gr##_8BIT: return PERI##instance##_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_8_VECT; \
    case CYHAL_CLOCK_BLOCK##instance##_PERIPHERAL##gr##_16BIT: return PERI##instance##_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_VECT; \
    case CYHAL_CLOCK_BLOCK##instance##_PERIPHERAL##gr##_16_5BIT: return PERI##instance##_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_16_5_VECT; \
    case CYHAL_CLOCK_BLOCK##instance##_PERIPHERAL##gr##_24_5BIT: return PERI##instance##_PERI_PCLK_PCLK_GROUP_NR##gr##_GR_DIV_24_5_VECT;
#endif

cy_rslt_t _cyhal_utils_reserve_and_connect(const cyhal_resource_pin_mapping_t *mapping, uint8_t drive_mode)
{
    cyhal_resource_inst_t pinRsc = _cyhal_utils_get_gpio_resource(mapping->pin);
    cy_rslt_t status = cyhal_hwmgr_reserve(&pinRsc);
    if (CY_RSLT_SUCCESS == status)
    {
        status = cyhal_connect_pin(mapping, drive_mode);
        if (CY_RSLT_SUCCESS != status)
        {
            cyhal_hwmgr_free(&pinRsc);
        }
    }
    return status;
}

void _cyhal_utils_disconnect_and_free(cyhal_gpio_t pin)
{
    cy_rslt_t rslt = cyhal_disconnect_pin(pin);
    CY_UNUSED_PARAMETER(rslt); /* CY_ASSERT only processes in DEBUG, ignores for others */
    CY_ASSERT(CY_RSLT_SUCCESS == rslt);
    cyhal_resource_inst_t rsc = _cyhal_utils_get_gpio_resource(pin);
    cyhal_hwmgr_free(&rsc);
}

cy_en_syspm_callback_mode_t _cyhal_utils_convert_haltopdl_pm_mode(cyhal_syspm_callback_mode_t mode)
{
    switch (mode)
    {
        case CYHAL_SYSPM_CHECK_READY:
            return CY_SYSPM_CHECK_READY;
        case CYHAL_SYSPM_CHECK_FAIL:
            return CY_SYSPM_CHECK_FAIL;
        case CYHAL_SYSPM_BEFORE_TRANSITION:
            return CY_SYSPM_BEFORE_TRANSITION;
        case CYHAL_SYSPM_AFTER_TRANSITION:
            return CY_SYSPM_AFTER_TRANSITION;
#if defined(COMPONENT_CAT1B)
        case CYHAL_SYSPM_AFTER_DS_WFI_TRANSITION:
            return CY_SYSPM_AFTER_DS_WFI_TRANSITION;
#endif
        default:
            /* Should not get here */
            CY_ASSERT(false);
            return CY_SYSPM_CHECK_READY;
    }
}

cyhal_syspm_callback_mode_t _cyhal_utils_convert_pdltohal_pm_mode(cy_en_syspm_callback_mode_t mode)
{
    switch (mode)
    {
        case CY_SYSPM_CHECK_READY:
            return CYHAL_SYSPM_CHECK_READY;
        case CY_SYSPM_CHECK_FAIL:
            return CYHAL_SYSPM_CHECK_FAIL;
        case CY_SYSPM_BEFORE_TRANSITION:
            return CYHAL_SYSPM_BEFORE_TRANSITION;
        case CY_SYSPM_AFTER_TRANSITION:
            return CYHAL_SYSPM_AFTER_TRANSITION;
#if defined(COMPONENT_CAT1B)
        case CY_SYSPM_AFTER_DS_WFI_TRANSITION:
            return CYHAL_SYSPM_AFTER_DS_WFI_TRANSITION;
#endif
        default:
            /* Should not get here */
            CY_ASSERT(false);
            return CYHAL_SYSPM_CHECK_READY;
    }
}

int32_t _cyhal_utils_calculate_tolerance(cyhal_clock_tolerance_unit_t type, uint32_t desired_hz, uint32_t actual_hz)
{
    switch (type)
    {
        case CYHAL_TOLERANCE_HZ:
            return (int32_t)(desired_hz - actual_hz);
        case CYHAL_TOLERANCE_PPM:
            return (int32_t)(((int64_t)(desired_hz - actual_hz)) * 1000000) / ((int32_t)desired_hz);
        case CYHAL_TOLERANCE_PERCENT:
            return (int32_t)((((int64_t)desired_hz - actual_hz) * 100) / desired_hz);
        default:
            CY_ASSERT(false);
            return 0;
    }
}

static inline cy_rslt_t _cyhal_utils_allocate_peri(cyhal_clock_t *clock, uint8_t peri_group, cyhal_clock_block_t div, bool accept_larger)
{
    static const cyhal_clock_block_t PERI_DIVIDERS[] =
    {
        CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT,
        CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT,
        CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT,
        CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT
    };

    cy_rslt_t result = CYHAL_HWMGR_RSLT_ERR_NONE_FREE;
    bool found_minimum = false;

#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
    bool dividers_exist = false;
#endif
    for(size_t i = 0; i < sizeof(PERI_DIVIDERS) / sizeof(PERI_DIVIDERS[0]); ++i)
    {
        if(PERI_DIVIDERS[i] == div)
        {
            found_minimum = true;
        }

        if(found_minimum)
        {
#if defined(COMPONENT_CAT1A)
            CY_UNUSED_PARAMETER(peri_group);
            result = _cyhal_clock_allocate_peri(clock, PERI_DIVIDERS[i]);
#elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
#if !defined(COMPONENT_CAT1D)
            cyhal_clock_block_t adjusted_div = (cyhal_clock_block_t)_CYHAL_PERIPHERAL_GROUP_ADJUST(peri_group, PERI_DIVIDERS[i]);
#else /* !defined(COMPONENT_CAT1D) */
            uint8_t instance = _CYHAL_UTILS_UNPACK_INSTANCE(peri_group);
            uint8_t group = _CYHAL_UTILS_UNPACK_GROUP(peri_group);
            cyhal_clock_block_t adjusted_div = (cyhal_clock_block_t)_CYHAL_PERIPHERAL_GROUP_ADJUST(instance, group, PERI_DIVIDERS[i]);
#endif /* !defined(COMPONENT_CAT1D) or other */
            dividers_exist |= (_cyhal_utils_get_clock_count(adjusted_div) > 0);
            result = _cyhal_clock_allocate_peri(clock, adjusted_div);
#elif defined(COMPONENT_CAT2)
            CY_UNUSED_PARAMETER(peri_group);
            result = cyhal_clock_allocate(clock, PERI_DIVIDERS[i]);
#endif

            if(CY_RSLT_SUCCESS == result || !accept_larger)
            {
                break;
            }
        }
    }

#if defined(COMPONENT_CAT1B)
    // If no dividers exist, try to reserve the hfclk that drives the peri group
    if(CY_RSLT_SUCCESS != result && false == dividers_exist)
    {
        uint8_t hfclk_idx = _cyhal_utils_get_hfclk_for_peri_group(peri_group);
        result = cyhal_clock_reserve(clock, &CYHAL_CLOCK_HF[hfclk_idx]);
    }
#endif
    return result;
}

