RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_utils_impl.c
#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
uint8_t _cyhal_utils_get_hfclk_for_peri_group(uint8_t peri_group)
{
    switch (peri_group)
    {
        /* Peripheral groups are device specific. */
#if defined(CY_DEVICE_CYW20829)
        case 0:
        case 2:
            return 0;
        case 1:
        case 3:
        case 6:
            return 1;
        case 4:
            return 2;
        case 5:
            return 3;
#elif defined(CY_DEVICE_TVIIBH8M) || defined(CY_DEVICE_TVIIBH4M)
        case 0:
            return 0;
        case 1:
            return 2;
#else
#warning "Unsupported device"
#endif /* defined(CY_DEVICE_CYW20829) */
        default:
            CY_ASSERT(false); /* Use APIs provided by the clock driver */
            break;
    }
    return 0;
}
#endif /* defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) */

#if defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C) || defined(COMPONENT_CAT1D)
uint8_t _cyhal_utils_get_peri_group(const cyhal_resource_inst_t *clocked_item)
{
    switch (clocked_item->type)
    {
        /* Peripheral groups are device specific. */
#if defined(CY_DEVICE_CYW20829)
        case CYHAL_RSC_CAN:
        case CYHAL_RSC_LIN:
        case CYHAL_RSC_SCB:
        case CYHAL_RSC_TCPWM:
            return 1;
        case CYHAL_RSC_CRYPTO:
            return 2;
        case CYHAL_RSC_I2S:
        case CYHAL_RSC_TDM:
        case CYHAL_RSC_PDM:
            return 3;
        case CYHAL_RSC_BLESS:
            return 4;
        case CYHAL_RSC_ADCMIC:
            return 5;
        case CYHAL_RSC_SMIF:
            return 6;
#elif defined(CY_DEVICE_TVIIBH8M) || defined(CY_DEVICE_TVIIBH4M)
        #if defined(CY_DEVICE_TVIIBH8M)
        case CYHAL_RSC_TCPWM:
            // 4 is the same as _CYHAL_TCPWM_MAX_GRPS_PER_IP_BLOCK
            if (clocked_item->block_num < 4)
            {
                return 0;
            }
            return 1;
        #else
        case CYHAL_RSC_TCPWM:
        #endif
        case CYHAL_RSC_ADC:
        case CYHAL_RSC_SCB:
        case CYHAL_RSC_CAN:
        case CYHAL_RSC_LIN:
            return 1;
#else
#warning "Unsupported device"
#endif
        default:
            CY_ASSERT(false); /* Use APIs provided by the clock driver */
            break;
    }
    return 0;
}
#endif

uint32_t _cyhal_utils_get_clock_count(cyhal_clock_block_t block)
{
    //NOTE: This could potentially reuse the cyhal_hwmgr.c cyhal_block_offsets_clock array
    switch (block)
    {
        #if defined(COMPONENT_CAT1)
        #if defined(COMPONENT_CAT1A)
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
            return PERI_DIV_8_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
            return PERI_DIV_16_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
            return PERI_DIV_16_5_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return PERI_DIV_24_5_NR;
        case CYHAL_CLOCK_BLOCK_PLL:
            return SRSS_NUM_PLL;
        #elif defined(COMPONENT_CAT1B) || defined(COMPONENT_CAT1C)
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 0)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 1)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 2)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(2);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 3)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(3);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 4)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(4);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 5)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(5);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 6)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(6);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 7)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(7);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 8)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(8);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 9)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(9);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 10)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(10);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 11)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(11);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 12)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(12);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 13)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(13);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 14)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(14);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 15)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(15);
        #endif
        case CYHAL_CLOCK_BLOCK_PERI:
            return PERI_PCLK_GROUP_NR;
        case CYHAL_CLOCK_BLOCK_PLL200:
            return SRSS_NUM_PLL200M;
        case CYHAL_CLOCK_BLOCK_PLL400:
            return SRSS_NUM_PLL400M;
        #elif defined (COMPOANENT_CAT1D)
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 0)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 0);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 1)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 1);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 2)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 2);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 3)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 3);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 4)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 4);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 5)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 5);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 6)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 6);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 7)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 7);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 8)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 8);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 9)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(0, 9);
        #endif
        #if (PERI0_PERI_PCLK_PCLK_GROUP_NR > 10)
        #warning "Unhandled number of PCLK for PERI0"
        #endif
        #if (PERI1_PERI_PCLK_PCLK_GROUP_NR > 0)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1, 0);
        #endif
        #if (PERI1_PERI_PCLK_PCLK_GROUP_NR > 1)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1, 1);
        #endif
        #if (PERI1_PERI_PCLK_PCLK_GROUP_NR > 2)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1, 2);
        #endif
        #if (PERI1_PERI_PCLK_PCLK_GROUP_NR > 3)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1, 3);
        #endif
        #if (PERI1_PERI_PCLK_PCLK_GROUP_NR > 4)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1, 4);
        #endif
        #if (PERI1_PERI_PCLK_PCLK_GROUP_NR > 5)
        _CYHAL_MXSPERI_PCLK_DIV_CNT(1, 5);
        #endif
        #if (PERI_PERI_PCLK_PCLK_GROUP_NR > 6)
        #warning "Unhandled number of PCLK for PERI1"
        #endif
        case CYHAL_CLOCK_BLOCK_PERI:
            return PERI_PCLK_GROUP_NR;
        case CYHAL_CLOCK_BLOCK_DPLL_LP:
            return SRSS_NUM_DPLL_LP;
        case CYHAL_CLOCK_BLOCK_DPLL_HP:
            return SRSS_NUM_DPLL_HP;
        #endif /* defined(COMPONENT_CAT1B) */

        case CYHAL_CLOCK_BLOCK_PATHMUX:
            return SRSS_NUM_CLKPATH;
        case CYHAL_CLOCK_BLOCK_HF:
            return SRSS_NUM_HFROOT;
        #elif defined(COMPONENT_CAT2) /* defined(COMPONENT_CAT1) */
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
            return PERI_PCLK_DIV_8_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
            return PERI_PCLK_DIV_16_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
            return PERI_PCLK_DIV_16_5_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return PERI_PCLK_DIV_24_5_NR;
        #endif /* defined(COMPONENT_CAT2) */
        default:
            return 1;
    }
}

